### Import packages

In [ ]:
import pandas as pd
import numpy as np

### import Data

In [2]:
raw_csv = pd.read_csv("/Time-Series/data/IndexE8.csv")
df_comp = raw_csv.copy()
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

### Lenght of the Time Period

In [3]:
df_comp.date = pd.to_datetime(df_comp.date,dayfirst=True)

In [4]:
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [5]:
df_comp.date.describe()

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### setting the index

In [6]:
df_comp.set_index('date',inplace=True)

In [7]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Setting the data frequency

In [8]:
df_comp = df_comp.asfreq('b')

In [9]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Handling Missng values

In [10]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [11]:
df_comp.spx = df_comp.spx.fillna(method='ffill') #front filling
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [12]:
df_comp.ftse = df_comp.ftse.fillna(method='bfill') #back filling
df_comp.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [13]:
df_comp.dax = df_comp.dax.fillna(value=df_comp.dax.mean()) #mean filling
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [14]:
df_comp.nikkei = df_comp.nikkei.fillna(method='bfill') #back filling
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

### add and remove columns

In [15]:
df_comp['market_value'] = df_comp.spx
df_comp.head()

               spx      dax     ftse    nikkei  market_value
date
1994-01-07  469.90  2224.95  3445.98  18124.01        469.90
1994-01-10  475.27  2225.00  3440.58  18443.44        475.27
1994-01-11  474.13  2228.10  3413.77  18485.25        474.13
1994-01-12  474.17  2182.06  3372.02  18793.88        474.17
1994-01-13  472.47  2142.37  3360.01  18577.26        472.47

In [20]:
df_comp.drop(columns=['spx','dax','ftse','nikkei'], inplace=True)

del df_comp.spx,df_comp.dax, df_comp.nikkei, df_comp.ftse

### Splitting data

In [21]:
size = int(len(df_comp)*0.8)
size

5021

In [23]:
df_train = df_comp.iloc[:size]
df_train.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [24]:
df_test = df_comp.iloc[size:]
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623